{
  "name": "Mohamad Nachawati",
  "heroTitle": "Full Stack Kehittäjä",
  "heroContent": "Olen asiantunteva full-stack-kehittäjä, joka on erikoistunut kestävien ja skaalautuvien verkkosovellusten kehittämiseen. Olen hionut taitojani etupään teknologioissa, kuten React ja Angular, sekä taustajärjestelmissä, kuten ASP.NET Core, Node.js, MySQL, PostgreSQL ja DynamoDB. Tavoitteeni on hyödyntää syvällistä asiantuntemustani innovatiivisten ratkaisujen kehittämisessä, jotka edistävät liiketoiminnan kasvua ja tarjoavat poikkeuksellisia käyttäjäkokemuksia.",
  "aboutMeTitle": "Tietoa <1>Minusta</1>",
  "aboutMeContent": "Olen syntynyt Damaskoksessa, Syyriassa, ja aloitin akateemisen urani valmistumalla maataloustekniikan apulaiseksi vuonna 2003. Tämän jälkeen työskentelin kuusi vuotta kirjanpitäjänä, jossa hiotin taitojani numerotyöskentelyssä ja organisaation hallinnassa. Valitettavasti Syyrian sota pakotti minut jättämään kotimaani, ja muuton jälkeen Turkkiin saavuin lopulta Suomeen vuonna 2017. Suomessa aloitin uuden elämän, opiskellen suomen kieltä ja siirtyen alalle, joka on aina kiinnostanut minua: teknologiaan. Tämä intohimo vei minut opiskelemaan tieto- ja viestintätekniikkaa LAB-ammattikorkeakouluun Lahteen, mistä valmistuin ohjelmistotekniikan insinööriksi vuonna 2023. Olen aina ollut kiinnostunut teknologian uusimmista kehityssuunnista ja intohimoni itseni kehittämiseen on ollut vahva lapsuudesta saakka. Nyt suuntaan tämän energian innovatiivisten ohjelmistoratkaisujen rakentamiseen ja ohjelmistotekniikan maailmaan osallistumiseen.",
  "aboutMeImageAltText": "Mohamad Nachawatin ammattimainen valokuva: intohimoinen full-stack-kehittäjä, erikoistunut skaalautuvien web-sovellusten kehittämiseen.",
  "TechnologiesTitle": "Technologiat",
  "ExperiencesTitle": "Kokemukset",
  "experiences": [
    {
      "year": "Toukokuu 2023 - Elokuu 2023",
      "role": "Pilviohjelmistokehittäjä Harjoittelija",
      "company": "Kempower Oyj",
      "description": "Kehitin uusia ominaisuuksia, mukaan lukien lokalisointi, samalla kun ratkaisin erilaisia virheitä parantaakseni sovelluksen toimivuutta ja käyttäjäkokemusta. Tein tiivistä yhteistyötä tutkimus- ja kehitysosaston kanssa, osallistuessani aktiivisesti Agile-menetelmien käyttöönottoon, ja opin kokeneilta ammattilaisilta korkealaatuisten ratkaisujen toimittamiseksi. Tämän prosessin aikana hyödynsin useita teknologioita, kuten TypeScriptiä, Node.js:ää, Angularia, Serverless-arkkitehtuuria ja AWS-palveluja, innovaatioiden edistämiseksi ja suorituskyvyn optimoimiseksi.",
      "technologies": [
        "TypeScript",
        "Angular",
        "Node.js",
        "DynamoDB",
        "Serverless"
      ]
    },
    {
      "year": "Syyskuu 2007 - marraskuu 2015",
      "role": "Kirjanpitäjä",
      "company": "Uncle Chipsin Tehdas",
      "description": "Järjestin toimittaja- ja asiakaskirjanpitoa, laadin kirjanpitoraportteja ja hallinnoin yleistä budjettia, mikä kasvatti taitojani kirjanpidossa, loogisessa ajattelussa ja ongelmanratkaisussa. Hanki käytännön kokemusta toimiston tietokoneohjelmista ja kirjanpito-ohjelmista.",
      "technologies": ["Afaq-kirjanpito ohjelma", "Microsoft Office"]
    }
  ],
  "projectsTitle": "Projektit",
  "projects": [
    {
      "title": "Live-tietojen visualisointi",
      "image": "../projects/Wind-power-production.jpg",
      "link": "https://github.com/MohamadNach/Live-Data-visualization-D3.js",
      "description": "Tarjoaa reaaliaikaisen datan visualisoinnin energiatiedoista Suomessa, erityisesti keskittyen tuulivoiman tuotantoon, sähkön tuotantoon ja kulutukseen.",
      "technologies": ["HTML", "CSS", "React", "D3.js"]
    },
    {
      "title": "Budget React App",
      "image": "../projects/budget-app.jpg",
      "link": "https://github.com/MohamadNach/budget-react",
      "description": "Reactorin ja TypeScriptin avulla kehitetty sovellus henkilökohtaisten talousasioiden hallintaan. Tämä sovellus on suunniteltu tarjoamaan käyttäjille tehokkaita työkaluja tulojen, menojen ja säästöjen hallintaan sekä taloudellisten tavoitteiden asettamiseen.",
      "technologies": ["HTML", "CSS", "React", "Redux"]
    },
    {
      "title": "Full stack E-commerce",
      "image": "../projects/ecommerce.jpg",
      "link": "https://github.com/MohamadNach/fullstack-ecommerce-app",
      "description": "Full-stack-verkkokauppasovellus, jossa frontend on rakennettu Reactin ja Reduxin avulla ja backend ASP.NET Core 8. Sovellus tarjoaa käyttäjille saumattoman ostokokemuksen sekä tehokkaan hallintajärjestelmän ylläpitäjille.",
      "technologies": [
        ".NET Core",
        "EF Core",
        "PostgreSQL",
        "React",
        "Redux",
        "TailwindCSS"
      ]
    }
  ],
  "contactMeTitle": "Ota Yhteyttä",
  "contactMe": {
    "address": "Osoite",
    "phone": "Puhelin",
    "email": "Sähköposti"
  },
  "footer": "Kaikki oikeudet pidätetään."
}
