{
  "name": "Mohamad Nachawati",
  "heroTitle": "Full Stack Developer",
  "heroContent": "I am a passionate full-stack developer with a knack for crafting robust and scalable web applications. I have honed my skills in front-end technologies like React and Angular and back-end technologies like ASP.NET Core, Node.js, MySQL, PostgreSQL, and DynamoDB. I aim to leverage my expertise to create innovative solutions that drive business growth and deliver exceptional user experiences.",
  "aboutMeTitle": "About <1>Me</1>",
  "aboutMeContent": "I was born in Damascus, Syria. I started my academic journey by graduating with a diploma as an Agricultural Engineering Assistant in 2003. Following that, I spent six years working as an accountant, honing my skills in numbers and organization. However, the war in Syria forced me to leave my homeland, and I eventually moved to Finland in 2017, after spending some time in Turkey. In Finland, I embraced a fresh start, learning the Finnish language and diving into a new field that has always intrigued me: technology. I pursued my passion by studying Information and Communications Technology at LAB University of Applied Sciences in Lahti, Finland, and successfully graduated as a Software Engineer in late 2023. Since childhood, I’ve been fascinated by the latest tech trends and have always had a thirst for learning and self-development. Now, I’m channeling that passion into building innovative solutions and contributing to the world of software engineering.",
  "aboutMeImageAltText": "Professional photo of Mohamad Nachawati, passionate full-stack developer focused on creating scalable web applications.",
  "TechnologiesTitle": "Technologies",
  "ExperiencesTitle": "Experiences",
  "experiences": [
    {
      "year": "2024",
      "role": "Full Stack Developer",
      "company": "Integrify",
      "description": "",
      "technologies": [
        "TypeScript",
        "React.js",
        "C#",
        "ASP.NET Core",
        "PostgreSQL"
      ]
    },
    {
      "year": "May 2023 - August 2023",
      "role": "Cloud Software Developer Trainee",
      "company": "Kempower Oyj",
      "description": "I developed new features, including localization, while resolving various bugs to enhance the application's functionality and user experience. Working closely with the R&D department, I actively participated in implementing Agile methodologies, collaborating with and learning from experienced professionals to deliver high-quality solutions. Throughout this process, I leveraged various technologies, including TypeScript, Node.js, Angular, Serverless architecture, and AWS services, to drive innovation and optimize performance.",
      "technologies": [
        "TypeScript",
        "Angular",
        "Node.js",
        "DynamoDB",
        "Serverless"
      ]
    },
    {
      "year": "September 2007 - November 2015",
      "role": "Accountant",
      "company": "Uncle Chips Factory",
      "description": "I Organized supplier and customer accounts, prepared accounting reports and managed the general budget, which fostered my skills in accounting, logical thinking, and problem-solving. Gained hands-on experience with office computer programs and accounting software.",
      "technologies": ["Aafaq Accounting Program", "Microsoft Office"]
    }
  ],
  "projectsTitle": "Projects",
  "projects": [
    {
      "title": "Live Data Visualization",
      "image": "../projects/Wind-power-production.jpg",
      "link": "https://github.com/MohamadNach/Live-Data-visualization-D3.js",
      "description": "Provides a live data visualization of energy information in Finland, specifically focusing on wind power generation, electricity production, and consumption.",
      "technologies": ["HTML", "CSS", "React", "D3.js"]
    },
    {
      "title": "Budget React App",
      "image": "../projects/budget-app.jpg",
      "link": "https://github.com/MohamadNach/budget-react",
      "description": "A personal finance management application built using React and TypeScript. The application is designed to help users manage their incomes, expenses, savings, and set financial goals efficiently.",
      "technologies": ["HTML", "CSS", "React", "Redux"]
    },
    {
      "title": "Full stack E-commerce",
      "image": "../projects/ecommerce.jpg",
      "link": "https://github.com/MohamadNach/fullstack-ecommerce-app",
      "description": "Full-stack e-commerce application with React and Redux for the frontend, and ASP.NET Core 8 for the backend. The goal is to provide a seamless shopping experience for users, along with a robust management system for administrators.",
      "technologies": [
        ".NET Core",
        "EF Core",
        "PostgreSQL",
        "React",
        "Redux",
        "TailwindCSS"
      ]
    }
  ],
  "contactMeTitle": "Contact Me",
  "contactMe": {
    "address": "Address",
    "phone": "Phone",
    "email": "Email"
  },
  "footer": "All Rights Reserved."
}
