{
  "name": "محمد نشواتي",
  "heroTitle": "مطور برمجيات متكامل",
  "heroContent": "أنا مطور شامل ذو شغف قوي ومهارة في تصميم تطبيقات ويب متينة وقابلة للتوسع. لقد قمت بتعزيز مهاراتي في تقنيات الواجهة الأمامية مثل React وAngular، وكذلك في تقنيات الواجهة الخلفية مثل ASP.NET Core وNode.js وMySQL وPostgreSQL وDynamoDB. أسعى لاستثمار خبرتي في تقديم حلول مبتكرة تساهم في تعزيز نمو الأعمال وتوفير تجارب مستخدم استثنائية.",
  "aboutMeTitle": " نبذة عني",
  "aboutMeContent": "وُلدت في دمشق، سوريا، حيث بدأت رحلتي الأكاديمية بالحصول على دبلوم مساعد مهندس زراعي في عام 2003. بعدها، عملت لمدة ست سنوات كمحاسب، مما مكنني من تطوير مهاراتي في الأرقام وإدارة العمليات. لكن الحرب في سوريا دفعتني إلى مغادرة وطني، وفي عام 2017 انتقلت إلى فنلندا بعد فترة من الإقامة في تركيا. في فنلندا، بدأت مسيرتي من جديد، فتعلمت اللغة الفنلندية وركزت على مجال طالما كان مصدر شغف لي: التكنولوجيا. واصلت تعليمي بدراسة تكنولوجيا المعلومات والاتصالات في جامعة LAB للعلوم التطبيقية في لاهتي، وتخرجت كمهندس برمجيات في نهاية عام 2023. لطالما كانت التكنولوجيا شغفي منذ الطفولة، ودائمًا ما كنت أبحث عن التعلم والتطوير الذاتي. اليوم، أستثمر هذا الشغف في تطوير حلول مبتكرة والمساهمة في مجال هندسة البرمجيات.",
  "aboutMeImageAltText": "صورة محمد نشواتي الاحترافية، مطور ويب متكامل متميز يختص بإنشاء تطبيقات ويب قابلة للتوسع وبجودة عالية.",
  "TechnologiesTitle": "التقنيات",
  "ExperiencesTitle": "الخبرات",
  "experiences": [
    {
      "year": "2024",
      "role": "مطور برمجيات متكامل",
      "company": "Integrify",
      "description": "",
      "technologies": [
        "TypeScript",
        "React.js",
        "C#",
        "ASP.NET Core",
        "PostgreSQL"
      ]
    },
    {
      "year": "مايو 2023 - أغسطس 2023",
      "role": "متدرب مطور برمجيات السحابة",
      "company": "Kempower Oyj",
      "description": "قمت بتطوير ميزات جديدة، بما في ذلك الترجمة المحلية، بالإضافة إلى حل مجموعة متنوعة من الأخطاء لتحسين وظائف التطبيق وتجربة المستخدم. عملت بشكل وثيق مع قسم البحث والتطوير، وشاركت بفعالية في تنفيذ منهجيات Agile، متعاوناً مع المحترفين ذوي الخبرة والتعلم منهم لتقديم حلول عالية الجودة. خلال هذه العملية، استخدمت مجموعة من التقنيات، بما في ذلك TypeScript وNode.js وAngular وServerless وAWS، لتعزيز الابتكار وتحسين الأداء.",
      "technologies": [
        "TypeScript",
        "Angular",
        "Node.js",
        "DynamoDB",
        "Serverless"
      ]
    },
    {
      "year": "سبتمبر 2007 - نوفمبر 2015",
      "role": "محاسب",
      "company": "معمل أنكل شيبس",
      "description": "لقد قمت بتنظيم حسابات الموردين والعملاء، وإعداد التقارير المالية، وإدارة الميزانية العامة، مما ساهم في تطوير مهاراتي في المحاسبة، والتفكير المنطقي، وحل المشكلات. كما اكتسبت خبرة عملية قيمة في استخدام برامج الحاسوب المكتبي وبرامج المحاسبة.",
      "technologies": ["Aafaq للمحاسبة", "Microsoft Office"]
    },
    {
      "year": "سبتمبر 2007 - نوفمبر 2015",
      "role": "محاسب",
      "company": "معمل أنكل شيبس",
      "description": "لقد قمت بتنظيم حسابات الموردين والعملاء، وإعداد التقارير المالية، وإدارة الميزانية العامة، مما ساهم في تطوير مهاراتي في المحاسبة، والتفكير المنطقي، وحل المشكلات. كما اكتسبت خبرة عملية قيمة في استخدام برامج الحاسوب المكتبي وبرامج المحاسبة.",
      "technologies": ["Aafaq للمحاسبة", "Microsoft Office"]
    }
  ],
  "projectsTitle": "المشاريع",
  "projects": [
    {
      "title": "التصوير المباشر للبيانات",
      "image": "../projects/Wind-power-production.jpg",
      "link": "https://github.com/MohamadNach/Live-Data-visualization-D3.js",
      "description": "يقدم عرضًا حيًا للبيانات المتعلقة بالطاقة في فنلندا، مع التركيز بشكل خاص على توليد الطاقة من الرياح، وإنتاج الكهرباء، واستهلاك الطاقة.",
      "technologies": ["HTML", "CSS", "React", "D3.js"]
    },
    {
      "title": "Budget React App",
      "image": "../projects/budget-app.jpg",
      "link": "https://github.com/MohamadNach/budget-react",
      "description": "تطبيق متقدم لإدارة الشؤون المالية الشخصية، تم تطويره باستخدام تقنيات React و TypeScript. يهدف التطبيق إلى تمكين المستخدمين من إدارة دخولهم ونفقاتهم ومدخراتهم، وتحديد أهدافهم المالية بفاعلية.",
      "technologies": ["HTML", "CSS", "React", "Redux"]
    },
    {
      "title": "موقع بورتفوليو",
      "image": "../projects/project-3.jpg",
      "description": "موقع بورتفوليو شخصي يعرض المشاريع والمهارات ومعلومات الاتصال.",
      "technologies": ["HTML", "CSS", "React", "Bootstrap"]
    },
    {
      "title": "منصة تدوين",
      "image": "../projects/project-4.jpg",
      "link": "https://github.com/MohamadNach/budget-react",
      "description": "منصة لإنشاء ونشر المدونات مع ميزات مثل تحرير النصوص الغنية، والتعليقات، والملفات الشخصية للمستخدمين.",
      "technologies": ["HTML", "CSS", "Vue.js", "Express", "mySQL"]
    }
  ],
  "contactMeTitle": "اتصل بي",
  "contactMe": {
    "address": "العنوان",
    "phone": "الهاتف",
    "email": "البريد الإلكتروني"
  },
  "footer": "جميع الحقوق محفوظة."
}
